############################################
# Set Common Variables
############################################
source ./tcl/common.tcl

############################################
# Various syntheis & dft setting
############################################
set verilogout_single_bit false
set verilogout_no_tri true
set verilogout_equation false
#set verilogout_show_unconnected_pins false
set hdlin_enable_rtldrc_info true
set test_default_scan_style multiplexed_flip_flop

############################################
# Target Library
############################################
set link_library          "$Std_cell_lib"
set target_library        "$Std_cell_lib"
set symbol_library        "$Symbol_lib"

############################################
# Work Directory
############################################
define_design_lib work -path work

############################################
# Read Files
############################################
analyze -format $HDL $RTL
#analyze -format $HDL $RTL -define SIM_DEBUG
elaborate ${TOP}
current_design ${TOP}
link
uniquify

############################################
# Wire Load Model
############################################
set_wire_load_model -name "ForQA"
set auto_wire_load_selection false
set_wire_load_mode "top"

############################################
# Clock Setting
############################################
create_clock -name clock -period $CLOCK_PERIOD [get_port ${CLOCK_PORT}]
set_dont_touch_network  clock

############################################
# Compile w/ Scan
############################################
compile -ungroup_all -scan
#write -f verilog -hier -output ${TOP}_scan${CHAIN_COUNT}.v.compile

############################################
# Set Scan Configuration
############################################
set_scan_configuration -chain_count ${CHAIN_COUNT}
set_scan_configuration -create_dedicated_scan_out_ports true

############################################
# Set Scan Path
# FF names are availabe in "scan_chain_rep" file generated by "report_scan_path" command
############################################
#set_scan_path scanchain1 -include_elements {address_reg[0] address_reg[2] count_reg2[0] count_reg2[2] memory_reg[0][0]} -complete true
#source set_scan_path.tcl

############################################
# Do Not Use "FF QN" for Scan Path
############################################
set_dft_insertion_configuration -synthesis_optimization none

############################################
# Insert DFT
############################################
create_test_protocol -infer_clock -infer_async
dft_drc
insert_dft

############################################
# Report
############################################
report_timing > ${W_area}/report/${TOP}_timing.txt
report_area > ${W_area}/report/${TOP}_area.txt
report_scan_path > ${W_area}/report/${TOP}_scan_path.txt
report_dft_signal > ${W_area}/report/${TOP}_dft_signal.txt

############################################
# File Output: Verilog Netlist & spf
############################################
change_names -rules verilog -hierarchy
set test_stil_netlist_format verilog
write -f verilog -hier -output ${W_area}/file_output/${TOP}_scan${CHAIN_COUNT}.v
write_test_protocol -o ${W_area}/file_output/${TOP}_scan${CHAIN_COUNT}.spf
write_sdf -version 2.1 -significant_digits 3 ${W_area}/file_output/${TOP}_scan${CHAIN_COUNT}.sdf
write_scan_def -o ${W_area}/file_output/${TOP}_scan${CHAIN_COUNT}.scandef

quit
